[
 
    {
      "_id": 2015,
      "titleImg": "https://drive.google.com/uc?id=1x7CIxpNldkFq0OK2huvZjOG8eb8178HQ",
      "bgImg": "https://drive.google.com/uc?id=1nPAG9ypXRGrOxiol7F5HmhOFZrSaey_L",
      "previewImg": "https://drive.google.com/uc?id=1Gkqt7honaP15jioQmHg6ffB8Z6S6SuSU",
      "video": "https://www.youtube.com/embed/02PPMPArNEQ",
      "title": "The Covenant",
      "fullTitle": "Guy Ritchie's The Covenant",
      "year": "2023",
      "date": "16th December",
      "ageLimit": "12+",
      "length": "2h 03min",
      "category": "Action",
      "type": "schedule",
      "description":"In March 2018, amidst the War in Afghanistan, U.S. Army Special Forces Master Sergeant John Kinley and his unit are ambushed by a truck bomb attack orchestrated by the Taliban during a routine vehicle inspection at Lashkargah, which claims the life of his interpreter. In need of a replacement, he is introduced to Ahmed Abdullah, a steadfast yet disliked interpreter, who claims he pursues the job only for money. During an undercover capture mission, Kinley learns that Ahmed was previously affiliated with the Taliban through the opium trade but had defected when the organization murdered his son. Ahmed later saves Kinley's team from being ambushed by a Taliban unit aided by a compromised Afghan National Army soldier, earning Kinley's respect. During another raid to check for a possible insurgent arms cache about 100 kilometres (62 miles) north of Bagram Air Base, Kinley's unit is attacked by Taliban reinforcements, who kill everyone except for him and Ahmed. The duo manage to escape on foot, killing several Taliban fighters in the process. Whilst attempting to return to the airbase by navigating through the mountainous Afghan terrain, they are once again ambushed by insurgents, who manage to wound Kinley, before clubbing him with a rifle butt, incapacitating him. Ahmed manages to kill the Taliban and resolves to take Kinley back to the air base. Receiving help from some sympathetic Afghans, Ahmed evades the Taliban hunting them, carrying Kinley over the country's treacherous mountain topography. Several days later Ahmed and Kinley are near Bagram but are attacked by Taliban fighters; Ahmed kills the fighters but is shortly thereafter apprehended by U.S. troops. Seven weeks later, Kinley, having been repatriated to his home in Santa Clarita, California, is completely unaware of how he was saved, but understands Ahmed's role in it. Upon learning that Ahmed and his family were forced to move underground owing to the duo's escapade having become local folklore, Kinley attempts to procure U.S. visas for them for over a month, but in vain. Emotionally tormented and rendered near sleepless by his inability to repay his indebtedness towards Ahmed, Kinley finally resolves to save him himself, enlisting the assistance of his superior, Lieutenant Colonel Vokes, to procure the visas. Returning to Afghanistan under the alias of Ron Kay, Kinley meets with Parker, a private military contractor, who promises to provide support on the condition that the former locates Ahmed first. Kinley meets Ahmed's brother Ali, a Taliban supplier who manages to smuggle Kinley across their territory; in the process, he kills two insurgents after nearly being caught at a road checkpoint, which alerts the Taliban. Vokes informs Kinley that the visas have been processed and are with Parker. Finally arriving at Ahmed's hideout, Kinley persuades him and his family to accompany him to the U.S. Meanwhile, Parker deduces Kinley's true identity; realizing the danger that the duo is in due to their value to the Taliban, he arranges for an AC-130 gunship and an Apache attack helicopter to provide air support. Concurrently, the Taliban mount an attack on Kinley, who manages to escape with Ahmed's family to the nearby Darunta Dam. Cornered by approaching Taliban units, the duo engage them in a protracted gunfight, which ends when they run out of ammunition. However, the AC-130 and Apache helicopter arrive and wipe out the attackers. Parker arrives from the other end of the dam with a relief column of anti-Taliban technicals. He tells Kinley he would have supported his mission gratis had he known upfront it was him. Escorted back to Bagram, the group boards an Airbus A400M leaving Afghanistan. The film's ending title states that in the aftermath of the Taliban's recapture of Afghanistan, over 300 Afghan interpreters affiliated with the U.S. military were murdered by the organization, with thousands more still in hiding.",
      "budget" : "Guy Ritchie's The Covenant (Afghanistan war film): This film, starring Jake Gyllenhaal and Dar Salim, had a reported budget of $40 million and earned a worldwide box office total of $34.7 million as of today, December 25, 2023. Guy Ritchie's The Covenant (Boston underworld thriller): This film, starring Tom Hardy and Hugh Jackman, had a reported budget of $55 million and earned a worldwide box office total of $21.8 million as of today, December 25, 2023.",
      "cast": "Jake Gyllenhaal as Master Sgt. John Kinley Dar Salim as Ahmed Abdullah Sean Sagar as Charlie Jizzy Crow Jason Wong as Joshua JJ Jung Rhys Yates as Tom Tom Cat Hancock Christian Ochoa as Eduardo Chow Chow Lopez Bobby Schofield as Steve Kersher Emily Beecham as Caroline Kinley Jonny Lee Miller as Col. Vokes Alexander Ludwig as Sgt. Declan O'Brady Tom Hardy as Johnathan Covenant Hugh Jackman as Mo Anatoly Yusef as Anton Kudin Olga Kurylenko as Katya Petrova Josh Hartnett as Detective Danny Sullivan Stephen Graham as Mickey The Brick O'Leary",
      "active": false
    },

    {
        "_id": 2014,
        "titleImg": "https://drive.google.com/uc?id=1fzTWHm79j2LGJuSMz7T_uY-YYwbk8sBb",
        "bgImg": "https://drive.google.com/uc?id=1p0bWTNZGLLo5ZO3xUEiDX9LYnfkGU8-N",
        "previewImg": "https://drive.google.com/uc?id=1exlXtBkndcXR_gJWCoornul5mj2Af-Yl",
        "video": "https://www.youtube.com/embed/23GmhsmrCIo",
        "title": "The Tank",
        "fullTitle": "The Tank",
        "year": "2023",
        "date": "03rd November",
        "ageLimit": "17+",
        "length": "1h 40min",
        "category": "Horror",
        "type": "schedule",
        "description": "The Tank is a movie about the monsters living under the creaky old house. When struggling California pet store owners Jules (Luciane Buchanan) and Ben (Matthew Whelan) learn they’ve inherited a substantial piece of coastline property in Oregon following the death of Ben’s mother, it seems like their financial woes have been resolved. So they trek up the coast with their daughter Reia (Zara Nausbaum) and family dog Archie to see what they’ve been left, discovering a boarded-up house covered in vines. The house looks promising but needs some work; however, the acres of coastline property are worth a pretty penny—even in the late 1970s, when the movie takes place. Still, newspaper clippings around the house suggest the area comes with a curse, spurred by a local legend about mysterious disappearances in the area. Ben’s father and sister, too, went missing before he was born. Doubtlessly, the family secrets have something to do with the old tank, which, connected to a system of caves, delivers fresh spring water to the house. A creature feature by New Zealand writer-director-producer Scott Walker (The Frozen Ground, 2013), The Tank is a juicy rendezvous with guy-in-a-suit monsters and gory practical effects. Unfortunately, Walker’s script is a by-the-numbers scenario, accented with clunky dialogue sold by the affable leads, Buchanan and Whelan. Watching the film, there’s something off about their delivery. It’s unclear whether their voices were entirely ADRed or if the actors delivered their lines with awkward English accents, but something seems not right throughout. Regardless, Buchanan stands out as a presence that commands this feature. Shooting in New Zealand and working with a local cast and crew, the movie’s Oregon setting seems commercially motivated to reach American markets. But a New Zealand cultural backdrop may have added some much-needed personality to these proceedings, and the shoreline shown throughout looks more like a primal jungle than forests along the West Coast.The first two-thirds of The Tank build tension effectively enough, aside from a few bumps along the way. Walker establishes a mystery around the deaths of Ben’s father and sister, the answers to which reside in his mother’s diary. While Jules reads her late mother-in-law’s inner thoughts about a “dark sadness,” this leads to some overwrought, blue-hued, slow-motion flashback sequences that appear haphazardly throughout the movie, lending faux gravitas. Meanwhile, Walker drops unsubtle hints of things to come: When, early on, Jules explains to Reia that an axolotl at their pet shop will “hunt on land” if taken out of the water, surely this is foreshadowing (though mostly inaccurate). Likewise, Walker introduces Chekov’s shed stocked with ammonium nitrate on the inherited property, promising an explosive scene later. To be sure, once Ben turns on the water pipes, he awakens a nest of blind, cave-dwelling creatures that start small but soon grow to a massive size (think salaMANder), using the forest that surrounds the house as hunting grounds. Walker’s approach to this juicy setup has plenty of antecedents. Universal’s classic Creature from the Black Lagoon (1954) and the Roger Corman-produced Humanoids from the Deep (1980) come to mind. For his monster design, Walker smartly inverts something lovable into something horrible—he turns everyone’s favorite meme-worthy amphibian into a horrific, oily creature with sharp teeth and a vaginal inner mouth, rendered with convincing practical effects. Scenes where Jules and Ben find themselves chest-deep in tank water, staring down an eyeless, subterranean creature that disappears below the surface, prove downright terrifying. Later, when Jules must rescue Reia from the monsters’ underground lair using a makeshift flamethrower, it’s modeled after Ripley saving Newt in James Cameron’s Aliens (1986). The allusionism throughout The Tank is sometimes distracting but not enough to rob the movie of its simple pleasures. Although the story makes much out of the family secrets angle, The Tank doesn’t build this aspect of the story well enough to land an emotional blow or impart an intriguing mystery. But Walker delivers gooey creatures and monster movie scares to spare. The visuals by cinematographer Aaron Morton keep the action clear in the many nighttime sequences set in the dark forest, rundown house, or underground tank, whereas the editing team often betrays spatial logic to create momentum and tension. This is never worse than the climax, which proves so visually confused that I was left with questions. For instance, we hear the family dog barking but never quite register his location in the escape, leaving this friend to animals more concerned about Archie than the human survivors. Along with a sense that this family resolved none of their conflicts and the threat remains on their property, The Tank left this critic unfulfilled, even on basic B-movie terms. Even so, there’s enough to be savored in Walker’s modest, hand-crafted execution to earn a mild recommendation as late-night fare.",
        "budget": "The Tank (2023, New Zealand/UK horror film): This film, about a family inheriting a mysterious property with a sinister secret, had a reported budget of $5 million and its box office revenue is not yet publicly available. The Tank (2023, Australian thriller film): This film, following a soldier on a lone mission through a post-apocalyptic desert, had a reported budget of $8 million and its box office revenue is also not yet publicly available.",
        "cast": "Luciane Buchanan Matt Whelan Zara Nausbaum Regina Hegemann Jack Barry  Holly Shervey Coco White Mark Mitchinson, Jaya Beach-Robertson, Ascia Maybury, Graham Vincent, Leonardo Walker, Sebastien Walker, Jatinder Singh, Minna Walker, Juana Luz Stratton, Ana Sanchez,Jaleh Kan. ",
        "active": false
      },
      {

        "_id": 2013,
        "titleImg": "https://drive.google.com/uc?id=1NPtXNZYTV6lM39b0PVtZiq1zMDGgFUNc",
        "bgImg": "https://drive.google.com/uc?id=1IAlpQLMvpKGz3ymNx3lpBulWToV9cUvg",
        "previewImg": "https://drive.google.com/uc?id=16rAQrvEmTitO06cbAmY77w-pgtQiV0-f",
        "video": "https://www.youtube.com/embed/z1xJAyVKAPY",
        "title": "The Black Demon",
        "fullTitle": "The Black Demon",
        "year": "2023",
        "date": "21st October",
        "ageLimit": "16+",
        "length": "1h 40min",
        "category": "Thriller",
        "type": "schedule",
        "description": "Nixon Oil company inspector Paul Sturges is sent to a small Mexican town in Baja California, to check on El Diamante, an offshore oil rig. He brings his wife Ines and their two children, Audrey and Tommy, along for a vacation. Upon arrival, the family finds the town in ruins. The remaining locals are suspicious and unfriendly, and fear turns to anger when they learn that Paul works for the company that commissioned the oil rig. Paul, seeking to see if the rig is worth revitalizing or decommissioning, takes a boat to it. He arrives to find the rig, dilapidated, hazardous and surrounded by an oil spill, crewed only by two remaining rig workers, Chato and Junior, along with their pet chihuahua. After being harassed and stalked by the angry locals, Paul's family decides to follow in another boat. As the boat arrives, Chato and Junior begin to panic and fire flares as a 70-ton megalodon shark, the Black Demon (Spanish: El Demonio Negro), which is prowling the waters, begins to chase the boat.Barel aging to get onto the rig unscathed, the family is forced to watch as the megalodon destroys the boat that brought them to the rig, killing its captain. After witnessing the attack, Chato reveals to Paul that some lucky crew members escaped the megalodon, adding that the radio on the rig does not function and calls made to Nixon Oil for help were ignored. Nixon Oil knew about the oil spill coming from the rig but never cared to fix the problem. Later, Ines discovers the safety reports for the rig and notices that the warnings have been ignored, and Paul signed the documents approving the rig's revitalization regardless of the dangerous conditions. When she confronts Paul about this, he admits his mistakes and adds that he did what he did to provide for his family, stating his job and economic security would be at risk if he did not act according to the company's interests. Nixon Oil developed self-inspections to get away with ignoring hazardous working conditions and threatened Paul when he attempted to confront them over this. Ever since, he has been forced to work in Nixon Oil's self-interest, while the local community suffered as a result of the company's negligence and greed. While Chato and Junior dive underwater to restore power to the rig. Chato believes the megalodon to be a herald of the god of rain, Tlaloc, who punishes those who take greedily from nature. Underwater, Paul notices a demolition bomb attached to a leg of the rig. Nixon Oil have actually been aspiring to kill him all along; realizing their practices would be reported sooner or later and that they would be blamed for the oil spill, the company had Paul sign the paperwork so that he would take the fall and die when the bomb detonated. Junior is killed by the shark and Chato narrowly escapes. Realizing the danger and hoping to set things right, Paul dives underwater (as his family and Chato escape) to seal the oil spill and destroy the megalodon. Though he seals the leak, the megalodon forces him to hide in the structure of the rig. Strapping the bomb to his chest, Paul realizes that to kill the megalodon, he will need to sacrifice himself. Over his radio, Paul says his last goodbyes to his family before letting the megalodon consume him. The bomb detonates, killing the megalodon and causing the rig to collapse. While leaving, Paul's family intends to give the documents he gave them to the townsfolk so they can hold Nixon Oil accountable. As they sail back to shore, a fishing boat rescues the group as a rainstorm begins.",
        "budget": "United States Screen count 700 Screen, Overseas 100 Screen, Total Worldwide800 Screen * approx, the black demon movie budgets, Production Budget $40 million, Prints & Advertising Costs $10 million, total budget $50 million",
        "cast": "Josh Lucas, Fernanda Urrejola, Héctor Jiménez, Julio Cesar Cedillo, Raúl Méndez, Venus Ariel, Jorge A. Jimenez, Edgar Flores, Carlos Solórzano, Omar Patin, Luis del Valle, Arturo Duvergé",
        "active": false
      },


      {
        "_id": 2012,
        "titleImg": "https://drive.google.com/uc?id=1hO5Yn_bYxmac25CXXbPiAzC0RutsT4zC",
        "bgImg": "https://drive.google.com/uc?id=1mYjLHQaLpT2kqh3rrFSifh_PJJS5vPM9",
        "previewImg": "https://drive.google.com/uc?id=1N-qRM7b-If2gl1z-YKzaBZCTGiH1aQva",
        "video": "https://www.youtube.com/embed/bHXejJq5vr0",
        "title": "Sixty Five",
        "fullTitle": "Sixty Five",
        "year": "2023",
        "date": "27th October",
        "ageLimit": "15+",
        "length": "1h 33min",
        "category": "Action",
        "type": "schedule",
        "description": "65,000,000 years ago, on the planet Somaris, pilot Mills is convinced by his wife that he should take on a two-year space expedition to earn the money needed to treat their daughter Nevine's illness. During the journey, his spaceship, the Zoic, is hit by a mass of asteroids and crash-lands on an alien planet, which unbeknownst to him, is actually Earth. With his ship damaged beyond repair, he finds that his passengers have been killed and contemplates suicide until he finds a lone survivor, a young girl named Koa. Mills sends a distress beacon for rescue and decides to take care of Koa. However, they have difficulty communicating due to differing languages and a broken translator.Mills later discovers a functioning escape shuttle from the Zoic has landed on top of a mountain. To encourage Koa to follow him, Mills lies about her family being atop the mountain, when in reality they perished in the crash. The pair quickly realize the planet is home to dangerous and aggressive alien creatures, which are actually Earth's dinosaurs. As Mills protects Koa, they begin to bondKoa watches several video messages sent by Nevine. The two are attacked by what appears to be a massive theropod, though Mills shoots it in the eye which only enrages it, forcing Koa and Mills to retreat further into a cave. After a rockfall separates them, Mills is attacked by an Oviraptor and Koa is attacked by a raptor-like creature which she traps in a fallen tree log; she uses bombs Mills had given her to kill the dinosaur. Mills kills the Oviraptor and escapes the cave, but falls into quicksand while searching for Koa. Koa rescues him and they continue up the mountain. Mills discovers that a huge asteroid, the same one whose debris his ship crashed into, will strike Earth in less than 12 hours.The two reach the escape shuttle, but Koa is angry when she discovers that Mills lied to her. Mills opens up to Koa about losing Nevine, who had died of her illness while he was away, and promises to protect her. Upon learning rescue is on the way, the two board the escape shuttle, but the asteroid's debris causes it to fall down the mountain. A pair of marauding Tyrannosaurus rex harass Mills and Koa, though Mills successfully kills both of them. Suddenly, the same predator Mills had partially blinded earlier, which turns out to resemble a hybrid of a theropod and a rauisuchid, also attacks. Mills manages to lure it toward a large geyser field while Koa stabs it in its remaining good eye with a large dinosaur claw that she coated in poison berries earlier, blinding it. The now blind carnivore then stumbles headfirst into a boiling hot geyser and is burned to death. The pair escapes just in time as the asteroid strikes Earth, causing a cataclysmic event and the extinction of the dinosaurs. With the pod set to meet up with a rescue vessel, the two relax and fly off into the stars.In closing titles, the evolution of Earth is shown, at the spot where Mills and Koa left, through an ice age until the present day. 65 is a 2023 American science fiction film written and directed by Scott Beck and Bryan Woods. Adam Driver stars as a space pilot who crashes on an unknown planet and attempts to escape while surviving with a young girl, played by Ariana Greenblatt. Beck and Woods produced with Sam Raimi, Deborah Liebling, and Zainab Azizi. 65 was released by Sony Pictures Releasing on March 10, 2023 and grossed $60 million worldwide against a production budget of $45 million. The film received mainly mixed reviews from critics.",
        "budget": "Box office65 grossed $32.1 million in the United States and Canada, and $28.6 million in other territories, for a worldwide total of $60.7 million.[3]In the United States and Canada, 65 was released alongside Scream VI and Champions, and was projected to gross $7–9 million from 3,350 theaters in its opening weekend.[2][32] The film made $4.4 million on its first day, including $1.22 million from Thursday night previews. It went on to slightly over-perform, debuting to $12.3 million and finishing third at the box office.[33] It made $5.8 million in its second weekend, finishing in third.[34]",
        "cast": "Adam Driver as Mills, Ariana Greenblatt as Koa, Chloe Coleman as Nevine, Nika King as Nevine's mom",
        "active": false
      },


      {
        "_id": 2011,
        "titleImg": "https://drive.google.com/uc?id=12bUN8O1PWOKgyI5onNCm7H7kc_WXlL_y",
        "bgImg": "https://drive.google.com/uc?id=1mDzH1gKJoI33euvqIFcVNTpcy_wiUDSm",
        "previewImg": "https://drive.google.com/uc?id=1sYdOUYJPuWhJ4c_EXUo-VDtoWoR7GlW4",
        "video": "https://www.youtube.com/embed/kpGo2_d3oYE",
        "title": "The Little Mermaid",
        "fullTitle": "The Little Mermaid",
        "year": "2023",
        "date": "27th September",
        "ageLimit": "12+",
        "length": "2h 14min",
        "category": "Romance",
        "type": "schedule",
        "description": "Ariel is a mermaid princess and the youngest daughter of King Triton, ruler of the merpeople of Atlantica. She is fascinated with the human world despite never having seen it, as Triton forbids all merfolk from surfacing there after Ariel's mother was killed by a human. One night, Ariel sees fireworks above the ocean and surfaces to see them better. They come from the ship of Eric, the prince of a nearby island. When a storm arrives, the ship crashes against rocks, forcing all to go for the lifeboats. Ariel saves Eric, brings him to shore, and sings with her siren voice to help save his life. She flees before he can regain full consciousness.         Noticing Ariel's absent-minded behavior, Triton questions his advisor Sebastian the crab, who reveals that she saved a human. Enraged, Triton travels to Ariel's grotto to confront her; when she refuses to swear to never return to the surface, he destroys her collection of human objects. Ariel is later approached by two moray eels sent by the sea witch Ursula, Triton's estranged sister and Ariel's aunt, who was banished from Atlantica 15 years prior.         At Ursula's lair, Ariel is presented with a deal: she will turn into a human for three days, during which she must receive true love's kiss to remain human permanently. If Ariel fails, she will transform back into a mermaid and Ursula will claim her. To become human, Ariel must give up her tail, the ability to breathe underwater, and her siren voice, the last of which Ursula will keep in a nautilus shell. Ariel accepts the deal. After receiving human legs, she is taken to the surface by Sergeant Major Flounder, her best friend, and Sebastian. In the human world, she is rescued and taken to Eric's castle. Eric, who has been searching for the woman who saved his life, rushes to meet Ariel. However, her lack of voice has him immediately turning away, though he does allow Ariel to stay in the castle for as long as she wants. While exploring the castle, Ariel finds Eric's collection of items he accumulated over his travels. Eric spends time with her poring over his collection.         The next day, Eric takes Ariel sightseeing around the kingdom. Sebastian, who has followed Ariel, realizes that Ursula has put a cheat in the spell that is causing Ariel to forget that she needs to kiss Eric. Along with Scuttle, a northern gannet, and Flounder, Sebastian takes it upon himself to get the pair to kiss. They are almost successful but are thwarted by Ursula's eels. Enraged by the close call, Ursula turns into a human and uses Ariel's siren voice to hypnotize Eric. Back at Atlantica, Triton has the kingdom search for Ariel and begins to regret the way he treated her.         The next morning, Ariel and her friends discover that Eric will be announcing his engagement to Vanessa (Ursula's alter ego) later that day. Ariel rushes to the engagement party, confronts Ursula, and breaks the shell. She gains back her voice, and the enchantment on Eric is broken. However, before they can kiss, the sun sets and Ariel transforms back into a mermaid. Reverting to her original form, Ursula drags Ariel back into the ocean.         Wanting to save Ariel, Triton confronts Ursula. However, the deal that she made with Ariel is unbreakable. Triton trades himself for Ariel and is turned to dust by the eels, much to her horror. Ursula claims Triton's trident just before Ariel confronts her while Eric arrives. Ursula attempts to destroy Eric, but to save Eric the second time, Ariel intervenes and intentionally attacks Ursula, who unintentionally kills her eels. Enraged, she uses the trident to grow in size and summons a storm to threaten Ariel and Eric. Ariel gets on a surfaced ship. Ursula is about to kill Eric with the trident. Saving Eric the third time, Ariel kills Ursula and impales her with its splintered bowsprit. Once Ursula dies, Triton comes back to life. Ariel picks up Triton's trident and hands it back to Triton. Triton is proud of Ariel for saving Eric three times and killing Ursula. Triton and Ariel recognize the other's sacrifice for them.         Ariel returns home, where she is unhappy without Eric. On Sebastian's advice, Triton transforms Ariel into a human permanently, and she marries Eric. The pair decide to travel together, with the blessing of both their parents and the support of people from both their worlds.",
        "budget": "The Little Mermaid grossed $298.2 million in the United States and Canada, and $271.4 million in other territories, for a worldwide total of $569.6 million.[3][4] Disney received a total of £46.6 million ($56.8 million) in COVID-19 insurance payouts related to the film from the UK government.[141] In the United States and Canada, The Little Mermaid—released alongside The Machine, Kandahar, About My Father, and You Hurt My Feelings—was projected to gross $120–125 million from 4,320 theaters over its four-day Memorial Day opening weekend.[142] The film made $38 million on its first day, including $10.3 million from Thursday night previews.[143] It went on to debut to $95.6 million in the traditional three-day weekend, and $118.8 million over the four-day frame, topping the box office and making it the fifth highest Memorial Day opening in history[118][144][145] (20th after inflation adjustment).[146] In its second weekend, the film declined 57% to $41.4 million while finishing in second place to newcomer Spider-Man: Across the Spider-Verse.[147][148] The film then made $23.2 million in its third weekend, finishing third behind newcomer Transformers: Rise of the Beasts and Across the Spider-Verse.[149][150] It remained in the top ten for five more weeks",
        "cast": "Halle Bailey  Ariel,  Jonah Hauer-King  Eric,  Melissa McCarthy  Ursula,  Javier Bardem  King Triton,  Noma Dumezweni  The Queen,  Art Malik  Sir Grimsby,  Daveed Diggs  Sebastian(voice),  Jacob Tremblay  Flounder(voice),  Awkwafina  Scuttle(voice),  Jessica Alexander  Vanessa,  Martina Laird  Lashana,  Emily Coates  Rosa,  Christopher Fairbank  Hawkins,  John Dagleish  Mulligan,  Matt Carver  Cabin Boy(as Matthew Carver),  Jude Akuwudike  Joshua,  Lorena Andrea  Perla,  Simone Ashley  Indira",
        "active": false
      },


      {
        "_id": 2010,
        "titleImg": "https://drive.google.com/uc?id=1EirRnVlgd53Mmg1Tv3AhDgyVRB_HyECC",
        "bgImg": "https://drive.google.com/uc?id=1M6Ro2wEgDqvV_PLzCTBk0U9CIyQKVwm2",
        "previewImg": "https://drive.google.com/uc?id=19qZxY9TdRGbeSeE3flCRGdUxIFCpcPu-",
        "video": "https://www.youtube.com/embed/XuDwndGaCFo",
        "title": "Heart of Stone",
        "fullTitle": "Heart of Stone",
        "year": "2023",
        "date": "25th November",
        "ageLimit": "14+",
        "length": "2h 02min",
        "category": "Adventure",
        "type": "coming",
        "description": "Heart of Stone is a 2023 American spy action thriller film directed by Tom Harper from a screenplay by Greg Rucka and Allison Schroeder and a story by Rucka.[3] The film stars Gal Gadot, Jamie Dornan, Alia Bhatt, Sophie Okonedo, and Matthias Schweighöfer. Its plot follows an international intelligence operative who must embark on a dangerous mission to protect a mysterious artificial intelligence system known as The Heart. She is tasked by the peacekeeping operation known as Charter to keep the object safe from falling into enemy hands.[4]         Development began in December 2020, when Gadot signed on to star. Harper and Netflix were confirmed to serve as director and distributor respectively the following month, with the rest of the cast being confirmed in early 2022. Filming took place in Europe from January to July of that year.        Heart of Stone was released on August 11, 2023, by Netflix.In the Italian Alps at a ski resort/casino, MI6 field agents Parker, Yang, and Bailey, supported by technician Rachel Stone, are tasked with extracting Mulvaney, an arms dealer who is there gambling on a US Navy SEAL combat operation somehow being livestreamed. When Yang is caught trying to sedate Mulvaney, a gunfight breaks out. Parker manages to extract Mulvaney to a cable car while the team heads down the mountain to confront Mulvaney's security.        Stone feigns injury to stay back and contact a mysterious agent named Jack feeding her probability information about how to safely get down the mountain and neutralize the incoming security. She manages to avoid contact with her team, who do not realize she is undercover; while extracting Mulvaney, he apparently takes cyanide to commit suicide.        In London, Stone is reprimanded for risking her cover by Nomad, her superior. Concerned by the presence of a hacker she saw in the Alps, Stone discovers she is Keya Dhawan, an orphan with links to Indian criminal syndicates. Stone's organization, the Charter (which Bailey suspects exists), leaks MI6 Keya's location and sends them to track her down in with Stone still undercover. Upon arrival, they are ambushed by a squad of mercenaries. Jack orders Stone to evacuate, but she refuses, going back to save the team at the expense of her cover. After they escape, Stone reveals she is a Charter agent.        Parker murders Yang and Bailey, revealing himself as a double agent working with Keya. He admits to covertly murdering Mulvaney as part of his mission to find The Heart, a quantum computer used to guide the Charter's missions. Parker paralyzes Stone with poison before planting a device in her to act as a trojan horse to infiltrate Charter systems. When Stone is recovered and taken to Charter HQ, the device begins breaching security. Stone cuts out the device, but the hackers learn the Heart's location and Nomad suspends Stone.        Nomad meets with the other 3 Kings running the charter, who reveal that Parker was an MI6 agent deliberately left for dead during an operation the Charter botched in Chechnya 8 years prior. Having learned from the hack that The Heart's command system is located in an airship over Africa, Parker and Keya fly to the ship. Stone intercepts them, but is unable to stop them from seizing The Heart and destroying the ship. She cuts the rope ladder to their helicopter and she and Keya parachute into the desert.        Keya informs Stone that she biometrically encrypted the Heart, and it is useless without her. A jeep picks up Stone and Keya and takes them to a village, which turns out to be a setup by Parker. Keya is captured and Stone escapes, eventually being rescued by another Charter operative. Stone goes to Iceland, where Parker is using a university supercomputer to exploit the Heart.        Parker uses the Heart to kill the other 3 Charter Kings and several operatives as well as trap the Charter in their bunker without an air supply; Keya becomes disillusioned with him since she intended to use the Heart only for financial gain. She helps Stone avoid an explosion set in a decoy location and reroutes her to Parker and the Heart's true location. Parker realizes Keya has betrayed him, and tries to force her to unencrypt the Heart. Stone arrives in time to rescue her, and manages to kill Parker. Keya uses the Heart to restore oxygen to the bunker and turns it back over to the Charter.        Four weeks later, Stone visits Keya in prison and offers her a job in the Charter. They then take on another mission as a new team of Stone, Jack and Keya.",
        "budget": "",
        "cast": " Gal Gadot as Rachel Nine of Hearts Stone, Jamie Dornan as Parker, Sophie Okonedo as Nomad / King of Hearts, Matthias Schweighöfer as Jack of Hearts, Paul Ready as Bailey, Jing Lusi as Yang, BD Wong as King of Clubs, Alia Bhatt as Keya Dhawan, Archie Madekwe as Ivo, Enzo Cilenti as Mulvaney, Jon Kortajarena as the Blond, Glenn Close as King of Diamonds Mark Ivanir as King of Spades",
        "active": false
      },


      {
        "_id": 2009,
        "titleImg": "https://drive.google.com/uc?id=1NOs4wWvMj55MGugVTOWSN3m6MRe7eoqf",
        "bgImg": "https://drive.google.com/uc?id=1csxQzmZ09GrsPQ_NuHOAmS16PxWCncrl",
        "previewImg": "https://drive.google.com/uc?id=1zXsWpojHMrDC3wkETjYr89obQEo97iGv",
        "video": "https://www.youtube.com/embed/9Ji5U2sTlLU",
        "title": "Peter Pan & Wendy",       
        "fullTitle": "Peter Pan & Wendy",       
        "year": "2023",
        "date": "14th October",
        "ageLimit": "12+",
        "length": "1h 49min",
        "category": "Adventure",
        "type": "coming",
        "description": "Peter Pan & Wendy is a 2023 American fantasy adventure film directed by David Lowery from a screenplay he co-wrote with Toby Halbrooks. Jim Whitaker served as producer on the Walt Disney Pictures production, which is a live-action adaptation of Walt Disney's 1953 animated film Peter Pan, in turn based on the 1904 play Peter Pan; or, the Boy Who Wouldn't Grow Up (also known as Peter and Wendy) by J. M. Barrie. The film stars Alexander Molony (in his film debut) and Ever Anderson in the title roles. Jude Law, Yara Shahidi, Alyssa Wapanatâhk, Joshua Pickering, Jacobi Jupe, and Jim Gaffigan also appear in supporting roles. The story follows Peter Pan and Wendy, who go to the magical world of Neverland with Wendy's brothers and Peter's best friend Tinker Bell. Along the way, Wendy embarks on the adventure that will change her life and encounters Peter's archenemy Captain Hook. Development on a live-action Peter Pan film began on April 13, 2016, with Lowery directing. Lowery was announced as writing the film with Halbrooks, while the production team expanded the next four years due to work in the remake's script. The film's title was announced on January 7, 2020. Production was expected to begin in April 2020 and wrap in August that year but was delayed due to the COVID-19 pandemic. Filming ultimately began in March 2021 in Vancouver, British Columbia. Shooting also occurred on the Bonavista Peninsula of Newfoundland and Labrador, in August 2021, and in the Faroe Islands.[2]        Peter Pan & Wendy premiered on Disney+ on April 28, 2023.In Edwardian London, Wendy Darling spends her last night at home with her parents and her two younger brothers, John and Michael, before leaving for boarding school the next day. She is unhappy with her departure and feels she does not want to grow up. Having heard Wendy's wish, Peter Pan arrives to take her to Neverland where she will never have to grow up. With the help of his companion, fairy Tinker Bell, Wendy, John, and Michael fly to Neverland.        Upon arriving, they are attacked by a ship of pirates, led by Captain Hook, who wants revenge on Peter for cutting off his right hand and throwing it to a crocodile. Wendy becomes separated from Peter and her brothers and meets Tiger Lily and the Lost Boys. She witnesses the pirates capturing John and Michael to drown them at Skull Rock. Peter fights the Captain, while Wendy, Tiger Lily, and the Lost Boys save John and Michael. Hook and the pirates are chased away by the crocodile.        Wendy learns from Peter that Captain Hook was once his best friend known as James, until he left Neverland and grew up to be a pirate. Hook's crew captures the Lost Boys and the Darling children, while the Captain attacks Peter, who seemingly falls to his death. Hook reveals to Wendy that the reason he left Neverland was because he missed his mother and wanted to find her. Eventually he got lost at sea and was rescued by his first mate, Mr. Smee, and the pirates, who raised him. When he returned to Neverland, Peter could not accept how much he had changed, and the two became enemies.        While Tiger Lily finds Peter and nurses him back to health, Hook forces Wendy to walk the plank, but she flies away with Tinker Bell's pixie dust and the happy thought of wanting to grow up. Tinker Bell flies the ship into the air with pixie dust, helping the Lost Boys break free and battle the pirates. Peter arrives to confront Hook, and after a long duel, finally apologizes to him for being a bad friend, but Hook does not want their rivalry to end. When Wendy turns the ship on its back, causing the pirates to fall off, Peter attempts to save Hook, encouraging him to fly, but without happy thoughts, he falls into the sea while losing his hook. Afterward, the Lost Boys decide they all want a real home, so they fly back to London on the ship with the Darlings.        Arriving home, Wendy introduces the Lost Boys to her parents. Peter reveals the Darlings' house was his old home until one day he ran away. Wendy suggests he stay, but Peter feels he is not ready to grow up. He bids farewell to Wendy and the Lost Boys, and returns to Neverland with Tinker Bell.        Back in Neverland, Hook and Smee are revealed to have survived the fall. Hook sees Peter returning on the ship and smiles happily.",
        "budget": "Critical Reception:The reviews for Peter Pan & Wendy’s were mostly positive. On Rotten Tomatoes, the movie has 212 reviews with an average score of 6.3/10 and a 72% approval rating. The consensus among critics, according to the website, is that “Peter Pan & Wendy is a faithful and visually stunning adaptation of the classic tale, with a strong cast and a heartwarming story.” The movie has 47 reviews and a weighted average rating of 62 out of 100 on Metacritic, which indicates “generally favorable reviews. ”Audience Response: The movies Peter Pan and Wendy did well at the box office. In comparison to its $150 million budget, the movie made nearly $213 million globally.",
        "cast": "Jude Law as Captain Hook, Alexander Molony as Peter Pan, Ever Anderson as Wendy Darling, Yara Shahidi as Tinker Bell, Alyssa Wapanatâhk as Tiger Lily, Joshua Pickering as John Darling, Jacobi Jupe as Michael Darling, Jim Gaffigan as Mr. Smee, Molly Parker as Mrs. Darling, Alan Tudyk as Mr. Darling, Florence Bensberg as Curly, Sebastian Billingsley-Rodriguez as Nibs, Noah Matthews Matofsky as Slightly, Caelan Edie as Tootles, Skyler and Kelsey Yates as twins, Diana Tsoy as Birdie, Felix De Sousa as Bellweather, John DeSantis as Bill Jukes, Garfield Wilson as Gurley, Ian Tracey as Sallyport, Mark Acheson as Old Clemson, Jesse James Pierce as Skylight, Cassie Van Wolde as adult Wendy, Deborah Ramsey as older Wendy",
        "active": false
      },


      {
        "_id": 2008,
        "titleImg": "https://drive.google.com/uc?id=1-XkzwUaF8ANMI2nap15JVF2oXaifBaV-",
        "bgImg": "https://drive.google.com/uc?id=1Gw6hyCyC3oOdViJNaxD9AoV5-2BzVbi6",
        "previewImg": "https://drive.google.com/uc?id=1z1KLdjj3lpVwhY3fG9Ep80xS-uWgxqdF",
        "video": "https://www.youtube.com/embed/7psP7xBEa28",
        "title": "No Hard Feelings",
        "fullTitle": "No Hard Feelings",
        "year": "2023",
        "date": "06th October",
        "ageLimit": "14+",
        "length": "1h 43min",
        "category": "Romance",
        "type": "coming",
        "description": "No Hard Feelings is a 2023 American sex comedy film starring Jennifer Lawrence as a woman who is hired by a wealthy couple to romance their inexperienced son. The film is directed by Gene Stupnitsky from a screenplay he co-wrote with John Phillips. Along with Lawrence, who was one of the film's producers, the film stars Andrew Barth Feldman, Laura Benanti, Natalie Morales, and Matthew Broderick. 32-year-old Maddie Barker is an Uber driver and bartender in Montauk, New York. She is facing bankruptcy after her car is repossessed as she owes property taxes on a home she inherited from her mother. Desperate to avoid losing the home, she accepts an unusual Craigslist posting. Her new employers, Alison and Laird Becker, ask her to date their 19-year-old son Percy in exchange for a Buick Regal. Since Percy is shy and has had no experiences with girls, drinking, parties, or sex, his parents hope to boost his confidence before he attends Princeton University in the fall. Maddie attempts to seduce Percy at the animal shelter where he volunteers. However, after she offers him a ride home, he mistakenly thinks that she is attempting to kidnap him and pepper sprays her. Despite this, they agree to go on a date the following day. Maddie and Percy meet at a bar the next night and then go skinny dipping at the beach. While they are in the water, a group of drunken teenagers try to steal their clothes. Maddie fights them in the nude, frightening Percy, who refuses to have sex with her. When she tries to leave without him, he jumps on her car, naked, and they outrun the police. She and Percy attempt to have sex, but he develops a rash from his anxiety, so Maddie nurses him. Maddie and Percy continue to date, sharing more about themselves and forming a friendship. Both reveal that they never went to prom, so they imitate a prom night, going to a fancy dinner where Percy plays the piano. Percy meets a school acquaintance, Natalie, in the restaurant who invites him to a party. After he and Maddie have a disagreement about their long-term plans, he goes to the party while Maddie searches for him. She finds him with Natalie in bed, though nothing happened between them, after he took an ibuprofen with alcohol. After leaving the party Percy confesses his love for Maddie. The next day, Percy tells his parents he wants to stay in Montauk with Maddie instead of going to Princeton. In a panic, his father offers her the car if she convinces him to go to Princeton. Percy inadvertently hears Maddie's deal with his parents. He invites Maddie to dinner with his parents, implying that he knows about their deal. While Maddie and his parents ask each other if he was told about the deal, Percy crashes the Buick into a tree, heavily damaging it. When he returns, Percy tries to have sex with Maddie. After prematurely ejaculating during foreplay, a betrayed Percy ends their relationship. Maddie takes the damaged car and becomes determined to pay off her debts. After Ubering for the remainder of the summer, she manages to save enough money to save her home and fix her car. Excited, Maddie tells her friends, Jim and Sara, but Sara asks Maddie if she really wants to stay in Montauk or is just doing it for her mother. The couple also admit they are moving out of Montauk to Florida due to housing costs. Maddie reflects on her life and tries to amend her wrongs. She reunites with Percy at a Princeton mixer and apologizes for betraying him. Not convinced, Percy starts to drive off when Maddie jumps on the hood of his car. Unable to see, Percy crashes the car into the ocean. As the car is towed, the pair reconcile and promise to stay friends. Maddie decides to sell the house to Jim and Sara and move to California to pursue her passion for surfing. Later, Maddie drives Percy to Princeton while on her way to California, and reveals that she has adopted Milo, a former police dog addicted to cocaine who lived at the shelter where Percy had volunteered. Maddie promises to call Percy during her entire drive to California.",
        "budget": "No Hard Feelings grossed $50.5 million in the United States and Canada, and $36.8 million in other territories, for a worldwide gross of $87.3 million.[3][4]In the United States and Canada, No Hard Feelings was released alongside the wide expansion of Asteroid City, and was projected to gross around $12 million from 3,208 theaters in its opening weekend.[2] The film made $6.25 million on its first day, including $2.15 million from Thursday night previews. It went on to slightly over-perform and debut to $15 million, finishing in fourth. In its second weekend, the film made $7.9 million, and a total of $11.3 million over the five-day Independence Day weekend. Its 48% drop considered a very solid hold in a post-COVID marketplace.[26] It then made $5.4 million in its third weekend, finishing in fifth.[27]",
        "cast": "Jennifer Lawrence as Maddie Barke, Andrew Barth Feldman as Percy Becker, Laura Benanti as Allison Becker,  Matthew Broderick as Laird Becker, Natalie Morales as Sara,  Scott MacArthur as Jim,  Ebon Moss-Bachrach as Gary,  Kyle Mooney as Jody,  Hasan Minhaj as Doug Khan,  Jordan Mendoza as Crispin,  Amalia Yoo as Natalie,  Alysia Joy Powell as Fern,  Quincy Dunn-Baker as Travis,  Matthew Noszka as hot guy from bar,  Zahn McClarnon as Gabe Sawyer, surfing lawyer,  Madison Odenborg as Melanie,  Achileas-Andreas of Greece as Teen",
        "active": false
      },


      {
        "_id": 2007,
        "titleImg": "https://drive.google.com/uc?id=1ikN3s7kN7mTboEzEw8Nwke4w8RoPdy1V",
        "bgImg": "https://drive.google.com/uc?id=1APcPb2pxFlbcKajlsx3x5RdBxQ78FQGV",
        "previewImg": "https://drive.google.com/uc?id=1wXLuoInaOl6gs52WXM7M27K0FPTGuh3_",
        "video": "https://www.youtube.com/embed/qiUATuIhUw8",
        "title": "Assassin",
        "fullTitle": "Assassin",
        "year": "2023",
        "date": "17th September",
        "ageLimit": "16+",
        "length": "1h 28min",
        "category": "Thriller",
        "type": "coming",
        "description": "As a long-time fan of Bruce Willis, it grew tough watching his movies go from box office gold to straight to video garb. But when news came out of his declining health (he’s since been diagnosed with frontotemporal dementia), it became clear why he had moved away from big studio productions and to smaller and easier roles. As a result of his condition, last year Willis’ family announced his retirement from acting. Suddenly movies didn’t seem all that important. Since 2019 he has appeared in 26 straight direct-to-video movies, many of which used him heavy in their promotions. Interestingly, he only had small supporting roles in most of them. The same is true with “Assassin”, a sci-fi thriller from first-time director Jesse Atlas that turns out to be the final film appearance of Willis’ impressive 43-year career. Unfortunately “Assassin” is yet another VOD dud but it certainly can’t all be put on Willis. There are several significantly bigger problems that end up dragging the movie down. Based on the short film “Let Them Die Like Lovers”, the movie has a premise that is ripe with potential. But it doesn’t have the budget or (more importantly) the creative know-how to pull it off. And it definitely doesn’t do enough for us to look past the uninspired performances, cringy dialogue, and painfully dull action. The story (written for the screen by Atlas and Aaron Wolfe) follows Alexa (Nomzamo Mbatha) who is shocked when her husband and fellow U.S. Army soldier Sebastian (Mustafa Shakir) comes back from his tour in a coma. Desperate to learn more about what happened to him, Alexa begins digging and discovers that Sebastian was actually on a super-secret mission working for a man named Valmora (Willis). Valmora and his associates Olivia (Fernanda Andrade) and Marko (Barry Jay Minoff) makeup a poorly defined black ops team who possess a technology that enables them to digitally map an agent’s consciousness into another person’s body. They can then use that body to carry out all kinds of missions, most notably assassinations. How it all works is anyone’s guess. The movie certainly doesn’t seem to care. All they need to pull it off is a bathtub, a laptop, and something that looks like an old car part (that’s what the movie tries to pass off as state-of-the-art tech). When Alexa finds Valmora he informs her that a dangerous fixer and smuggler named Adrian (Dominic Purcell) has stolen a tiny piece of their tech that must be recovered if Sebastian is to ever wake up from his coma (don’t ask). So Valmora recruits Alexa to take over the the minds of strangers and assassinate those close to Adrain leaving him vulnerable. Then she can take him out and steal back the tech that can bring back Sebastian. As you might expect they hit a few snags that by design usually adds tension to a story. That’s not the case here mainly because the movie shows no sense of urgency. There’s no energy or excitement. It toys with thought-provoking ideas and poses some meaty questions especially when digging into the moral queasiness of entering and controlling another’s body. “We kill the bad guys. Someone else takes the fall.” That line alone should provoke some compelling considerations. Unfortunately “Assassin” doesn’t do anything with the boxes it opens up. And that speaks to the movie’s biggest problem. Yes, “Assassin” is plagued with bad performances throughout and the action never (and I do mean never) gets to room temperature. But it’s the script that turns out to be the biggest liability. The wafer-thin characters fumble through equally shallow (and sometimes astonishingly lame) dialogue. There’s no worthwhile hero or villain. And the story has so many holes it quickly devolves into something impossible to latch onto. It’s truly heartbreaking to see Willis’ career end on such a sour note. But that doesn’t take away from the years of great characters, great energy, and great personality he has given us. From “Moonlighting” to “Die Hard” to “Pulp Fiction” to “The Sixth Sense” to “Moonrise Kingdom”. What a terrific filmography. And because of that, we will always be grateful. “Assassin” is streaming on Hulu”. ",
        "budget": "All Time International Box Office (Rank 19201-19300) Amount$51530 ,All Time International Box Office for R Movies (Rank 3301-3400) Amount $51530, All Time Worldwide Box Office for R Movies (Rank 5401-5500) Amount $51530 ,All Time Worldwide Box Office (Rank 26,201-26,300) Amount $51530",
        "cast": "Nomzamo Mbatha as Alexa, Bruce Willis as Valmora, Dominic Purcell as Adrian, Andy Allo as Mali, Mustafa Shakir as Sebastian, Fernanda Andrade as Olivia, Eugenia Kuzmina as Trainer, Hannah Quinlivan as Special Agent, Production",
        "active": false
      },


      {
        "_id": 2006,
        "titleImg": "https://drive.google.com/uc?id=1izcfaK2pNpBYsUEf5AA9yCG8gtAyrBQi",
        "bgImg": "https://drive.google.com/uc?id=1v5lK11ClUuhmb-yZhE5t5tHVLqDktyPp",
        "previewImg": "https://drive.google.com/uc?id=1UpNnMd1ji16YYVQLs1MycKBzb63z4Vug",
        "video": "https://www.youtube.com/embed/dtyPh5yCoWg",
        "title": "Ape vs. Mecha Ape",
        "fullTitle": "Ape vs. Mecha Ape",
        "year": "2023",
        "date": "30th December",
        "ageLimit": "14+",
        "length": "2h 45min",
        "category": "Thriller",
        "type": "coming",
        "description": "Not letting the success of Ape vs Monster go to waste, The Asylum is back with Ape vs.Mecha Ape. This time, they’ve brought in Marc Gottlieb to write and direct. While it’s only his second feature, the other was Cousin Howard back in 1995, and the first one for The Asylum he’s written several scripts for them including Jungle Run, 2025 Armageddon, and Aquarium of the Dead. Can he kick the franchise into gear after its dismal first film? The film opens with a chemical weapons plant that looks like an old warehouse being attacked by what looks like the giant ape, Abraham. A few explosions later we see that it’s actually a giant, well-armed, robot which makes short work of the plant’s security. The real Abraham meanwhile is upset. A drone has gotten into his preserve and pissed him off. Sloane (Anna Telfer, Time Pirates, Planet Dune) has been called in to calm him down and the drone’s pilot, animal rights activist Joel (Jack Pearson, Attack on Titan, Shark Season) is being interrogated. Back in Volodrezjka, I guess Russia was too hard to spell, Pavla (Iris Svis, Stan the Man, Monday Coffee) is upset by the death of her son in the attack. And since his father Arnott (Xander Bailey, Bullet Train Down, Shark Waters) is a big shot in their foreign intelligence service, something will be done about it, and Mecha Ape will be the tool they use to do it.         With a title that recalls Godzilla vs Mechagodzilla and a plot inspired by King Kong Escapes, a recovered nuke and a high-tech spy Roomba, Ape vs.Mecha Ape is obviously meant to be taken with tongue in cheek. Given the highly variable quality of The Asylum’s output, the question is, which set of cheeks are we talking about?On a positive note, this is better than Ape vs Monster. The first half of the film is still mostly talk, but the effects we do see are of a better quality than those in the original. Sadly, most of Mecha Ape’s rampage is off-screen, and we just hear about it and see the damage until the final act when it tangles with Abraham. Helping to offset that, the plot for Ape vs. Mecha Ape isn’t as eye rollingly ridiculous and the dialogue moves the story along at a decent pace, so at least it doesn’t get as boring as many of their films before the now nuclear-equipped robot reaches Chicago.Making his Asylum debut as Secretary of Defense Hamilton Tom Arnold (True Lies, Dead Ant), as expected, has few scenes with the rest of the cast. Oddly the way the script is set up the same holds true for most of the rest of the cast as well, giving Ape vs.Mecha Ape a cut-and-paste feel to it.         Sloane spends most of the film inside the robot trying to shut it down. The Volodrezjkain agents have no scenes with the other main cast. Joel, along with Pierce (Corbin Timbrook, The Unhealer, The Belly of the Beast) and Laura (Lisa Lee, Love at the Lodge, Megalodon Rising) have a few scenes with Sloane at the beginning and end of the film but are together through most of it and have no scenes with anyone else.         When the title creatures finally do get to brawl, the Ape vs. Mecha Ape showdown is better than what we got in the first film. The effects are solid and there are more scenes of destruction, though still not as much as kaiju fans will be expecting. If it had included a couple of scenes of Mecha Ape vs. military action, this could have been a much better film. Instead, it doesn’t rise much above watchable, wasting an amusing plot and good effects in the process.",
        "budget": "",
        "cast": "Tom Arnold Hamilton  Anna Telfer-  Sloane,  Lisa Lee-  Laura,  Jack Pearson-  Joel,  Corbin Timbrook-  Pierce,  Xander Bailey-  Arnott,  Iris Svis-  Pavla Oalk,   Lindsey Marie Wilson-  Blanka,   Sady Diallo-  Florien,   Eugenia Kuzmina-  Zara,   Jeff Rector-  General Dean (as Jeffrey Rector),   Maureen Kedes-  Boyd,   Mikwan J. Jones-  FBI Agent  Rasko Relic-  Vololodrezjkan General   Josh Duhon  Vololodrezjkan Soldier  Amor Jones-  Bike Rider  Elizabeth Harding-  Volodrezjkan Soldier (uncredited)  Brendan Petrizzo-  Volodrezjkan Soldier (uncredited)  Ivana Trisic-  Activist Crowd Member (uncredited)",
        "active": false
      },


      {
        "_id": 2005,
        "titleImg": "https://drive.google.com/uc?id=1mDwf-L1ZL9OUgkc_Nbtr_Z9QeYsIDRrj",
        "bgImg": "https://drive.google.com/uc?id=1USIXkfTlLDthopiA9QDag4jduyQiB_g7",
        "previewImg": "https://drive.google.com/uc?id=1MI7a20SJM74hR9BvlHyKQygrzMGOVS_G",
        "video": "https://www.youtube.com/embed/nvaenzyXl4o",
        "title": "Beautiful Disaster",
        "fullTitle": "Beautiful Disaster",
        "year": "2023",
        "date": "12th November",
        "ageLimit": "12+",
        "length": "1h 45min",
        "category": "Romance",
        "type": "coming",
        "description": "",
        "budget": "",
        "cast": "",
        "active": false
      },


      {
        "_id": 2004,
        "titleImg": "https://drive.google.com/uc?id=10avNvckAHe8RpXRRYsbXMFuJ_E415oXS",
        "bgImg": "https://drive.google.com/uc?id=1hYF60OZvsC1A4aQ1axcVFshAEnri84AY",
        "previewImg": "https://drive.google.com/uc?id=1175uStmX3RA6y6oxkXwq2kxMbsujxO7H",
        "video": "https://www.youtube.com/embed/lshAqOT7BB8",
        "title": "Jailer",
        "fullTitle": "Jailer",
        "year": "2023",
        "date": "09th November",
        "ageLimit": "15+",
        "length": "2h 48min", 
        "category": "Action",
        "type": "coming",
        "description": "Jailer redirects here. For the Malayalam film, see Jailer (2023 Malayalam film). For other films, see Jailer. Jailer is a 2023 Indian Tamil-language action comedy film directed by Nelson Dilipkumar and produced by Kalanithi Maran of Sun Pictures. The film stars Rajinikanth in the lead role, alongside Vinayakan, Ramya Krishnan, Vasanth Ravi, Tamannaah Bhatia, Sunil, Mirnaa Menon, and Yogi Babu in supporting roles. Mohanlal, Shiva Rajkumar and Jackie Shroff play guest appearances. It revolves around a retired jailer seeking to apprehend an eccentric idol smuggler.        The film was officially announced in February 2022 with the working title Thalaivar 169, being the 169th film of Rajinikanth, while the official title Jailer was announced in June. Principal photography began in August 2022 in Chennai and wrapped in June 2023. The music is composed by Anirudh Ravichander, while the cinematography and editing were handled by Vijay Kartik Kannan and R. Nirmal.        Muthuvel Pandian is a retired police officer who lives in Kodambakkam with his family. Muthuvel's son ACP Arjun is investigating Varman, an eccentric gangster operating from his base of operations in Arakkonam, who smuggles idols of gods and sells them to buyers overseas. Arjun confronts Varman's henchman Seenu and demands him about the whereabouts of Varman. While getting close to nabbing Varman, Arjun suddenly goes missing and the police department covers this up by spreading word that he may have committed suicide due to the stress of the job.        Grieving the loss of his son and partly blaming himself for raising him to be honest and fearless, Muthuvel goes after Seenu and murders him, disposing the body by coercing a clueless local taxi driver Vimal into helping him. In retaliation, Varman's men attempt to kill Muthuvel's grandson Rithvik, but Muthuvel manages to save him. Muthuvel tries to convince Varman to leave him and his family alone, but to no avail. Enraged, he decides to fight back.        First, Muthuvel blackmails a psychiatrist S. Dhandapani into providing asylum for his family. He then visits Narasimha, a reformed criminal living in Mandya, who loans him four of his sharpest shooters. With the help of Narasimha's men, Muthuvel steals Varman's idols that were being smuggled and uses them to blackmail and humiliate Varman, who was about to kill his family. In response, Varman thires a Bihari gangster named Kamdev to send people to kill Muthuvel and his family at his home, but Muthuvel and Narasimha's men finish them off. On discovering Varman's target to be Muthuvel, Kamdev reveals to him that Muthuvel was the former ruthless and charismatic jailer of Tihar prison who disciplined the criminals harshly but also helped them reform, thus gaining a massive network of allies, including Kamdev.        Muthuvel corners Varman in his base along with a hundred men sent by another former criminal Sikandar Singh, but Varman reveals that Arjun is still alive and threatens to kill him. Both of them ultimately arrive at a compromise: Varman will release Arjun in exchange for retrieving a famous antique crown that is currently secure in a temple in Mangalagiri. Muthuvel plans a heist involving the Telugu actor Blast Mohan, who is a trustee of the temple where the crown is held. After various deceptions and with the help of a smuggler in Mumbai named Mathew, Muthuvel eventually comes into possession of the crown and sends it to Varman, but it is later revealed that the crown which Muthuvel sent was a fake.        Varman frees Arjun, who reveals himself as a corrupt police officer wanting to be cut in on Varman's operations, willing to kill his own father for money. However, the fake crown also conceals a hidden camera and their entire conversation is seen by Muthuvel. He attacks Varman's hideout with Kamdev, Vimal, and his allies, killing Varman and his men, while Narasimha protects Muthuvel's family and Mathew destroys Varman's smuggling operations. Muthuvel gives Arjun one chance to surrender, but he refuses and attempts to kill him. Arjun is shot and killed by Narasimha's men, while Muthuvel solemnly walks away.",
        "budget": "Jailer grossed an estimated ₹95 crore on its opening day worldwide of which ₹52 crore crore was from India.[59][60] The opening day grosses were ₹23 crore in Tamil Nadu, ₹5.85 crore in Kerala, ₹10 crore in Telugu states, ₹11 crore in Karnataka, ₹4.5 crore in North India, ₹40 crore internationally.[61] As of 21 August 2023, Jailer had grossed ₹194.7 crore in Tamil Nadu, ₹75 crore in Andhra Pradesh and Telangana and ₹60 crore in Karnataka.[62] It has also grossed ₹166.31 crore at the overseas box office.[63] The Times Of India, India Today and Hindustan Times reported the box office collection of Jailer to be at ₹655 crore in its total theatrical run while Track Tollywood and T2blive box office source cited that Jailer Box Office as the highest Kollywood movie for the year 2023 and all time 2nd highest Kollywood movie after 2.0. Baradwaj Rangan while interacting with Kollywood directors listed the top 5 grossers of 2023 as Jailer, Leo, PS2, Varisu and Thunivu.[69] As per Track Tollywood Jailer had a lead of 35 crores over Leo, the top2 movies released in 2023. As per TimesofIndia Jailer became the first film to earn 100 crores share in Tamil Nadu.[72] Jailer created various records which includes being the highest grossing Tamil movie in North America, highest grossing Tamil movie in Karnataka, highest grossing movie in Tamil Nadu ",
        "cast": " Rajinikanth as Tiger Muthuvel Pandian IPS, Vinayakan as Varman, Ramya Krishnan as Vijaya Viji Pandian, Vasanth Ravi as ACP Arjun Pandian IPS, Tamannaah Bhatia as Kamna, Sunil as Blast Mohan, Yogi Babu as Vimal, Mirnaa Menon as Swetha Pandian, Rithvik as Rithvik Rithu Pandian, Harshad as Dhanraj, Jaffer Sadiq as Debnath, G. Marimuthu as Panneer, VTV Ganesh as Dr. S. Dhandapani, Redin Kingsley as Divya Nathan, Sunil Reddy as Bagunnara Balu, Saravanan as Seenu, Aranthangi Nisha as G. Kanagalakshmi, Mahanadi Shankar as a police constable, Padam Kumar as Raja Rao, Karate Karthi as Sanju, Sugunthan as Narasimha's henchman, Billy Muralee as Panju, Pavel Mani as Seenu's masseur, Sooraj Pops as Varman's henchman, Dancer Ramesh as Varman's henchman, Haji Mohammed as Kareem's gang member, Cameo appearances, Mohanlal as Mathew, Shiva Rajkumar as Narasimha, Jackie Shroff as Kamdev, Kishore as Jaffar, Makarand Deshpande as Sikandar Singh, Naga Babu as Balsingh, Muthuvel's former colleague, Jani as himself in the song Kaavaalaa, Uday Mahesh as a CBI officer (uncredited), Production",
        "active": false
      },


      {
        "_id": 2003,
        "titleImg": "https://drive.google.com/uc?id=1seXLa6OP6VQ5SGynJWnPEYM6r8sor_rW",
        "bgImg": "https://drive.google.com/uc?id=1h1u7nfwxbm3aPCJ67bevYKN-cbkvaiNh",
        "previewImg": "https://drive.google.com/uc?id=1Dz3WeDfRTOlHcYEo1QOa2Y5jTNP2qGSr",
        "video": "https://www.youtube.com/embed/32RAq6JzY-w",
        "title": "Fast X",
        "fullTitle": "Fast X",
        "year": "2023",
        "date": "04th October",
        "ageLimit": "12+",
        "length": "2h 21min",
        "category": "Action",
        "type": "coming",
        "description": "Fast X (also known as Fast & Furious 10) is a 2023 American action film directed by Louis Leterrier from a screenplay written by Dan Mazeau and Justin Lin, both of whom also co-wrote the story with Zach Dean. It is the sequel to F9 (2021), the tenth main installment, and the eleventh installment overall in the Fast & Furious franchise. It stars Vin Diesel as Dominic Toretto alongside an ensemble cast including Michelle Rodriguez, Tyrese Gibson, Chris Ludacris Bridges, John Cena, Nathalie Emmanuel, Jordana Brewster, Sung Kang, Scott Eastwood, Daniela Melchior, Alan Ritchson, Helen Mirren, Brie Larson, Rita Moreno, Jason Statham, Jason Momoa, and Charlize Theron. In the film, Toretto must protect his family from Dante Reyes (Momoa), who seeks revenge for his father's death and the loss of his family's fortune. Dominic Toretto and his team are requested by the Agency to steal a computer chip during its transit in Rome. Dom and his wife Letty Ortiz stay behind with his son Brian Little B Marcos, while the rest of the team, consisting of Roman Pearce, Tej Parker, Han Lue, and Ramsey, travels to Rome. A wounded Cipher arrives at Dom's home and informs him and Letty that Dante Reyes, the son of drug lord Hernan Reyes, has turned her crew against her and is using them to target Dom as revenge for his father's death and the loss of his family's fortune ten years prior.[b] When Little Nobody says that there is no Agency mission in Rome, Dom and Letty realize that Dante set them up and they go to rescue the team.         In Rome, Dante releases a metal ball bomb into the streets. Dom pushes it into the Tiber River, minimizing the damage, but Letty is arrested. Agent Aimes, the Agency's de facto leader since Mr. Nobody's disappearance,[c] believes that Dom and his team are responsible for the bombing and begins a manhunt. In Los Angeles, Dom's brother Jakob rescues Little B and Mia, his and Dom's sister, from a squad sent by Dante to kidnap Little B and with her approval, takes Little B to a secret location in Portugal, where they will await Dom. Mr. Nobody's daughter, Tess, is convinced of the team's innocence and uses God's Eye[d] to find Dom in Naples, informing him that Dante is in Rio de Janeiro.         There, Dom confronts Dante and meets Isabel Neves, the sister of Little B's late mother Elena.[e] Dom later challenges Dante to a race, along with Isabel and his ally, Diogo. However, Dante wins while killing Diogo and injuring Isabel. Tess visits Letty at the black site and covertly wounds her to send her to the prison's treatment center, where Letty meets Cipher. They discover the black site is located in Antarctica and they must work together to escape. In London, Dom's team turns to Deckard Shaw for help, through the convincing of Han after a scuffle between himself and Deckard. Tess gets shot by the sniper and Dante steals the God's eye from Tess.         Aimes joins forces with Dom to fight Dante. Dante locates Little B in Portugal and kidnaps him. As Dom is cornered by mercenaries, Jakob sacrifices his life to take them all out, allowing Dom to rescue his son. Dante again corners Dom and his son, just as Roman, Tej, Han, and Ramsey arrive by plane to aid Dom. Realizing too late, Dom tells Roman to turn the plane around, but Aimes, revealed to be working for Dante, shoots down the plane, leaving each member of the team's fates unknown. Dom drives off the edge of the dam they are on to avoid Dante's trap, but Dante has the dam rigged with explosives and arms them, leaving Dom and Little B's fates unknown as well. In Antarctica, Gisele Yashar, who was presumed dead,[f] emerges from a submarine to rescue Letty and Cipher.         In a mid-credits scene, Luke Hobbs infiltrates an abandoned theatre with a team of agents where he is contacted by Dante who tells him that he will be his next target for killing his father.         Cast",
        "budget": "Fast X has grossed $146.1 million in the United States and Canada, and $568.5 million in other territories, for a worldwide total of $714.6 million.[4][5] Prior to its release, TheWrap estimated the film would need to gross $800–850 million worldwide in order to turn a profit.[178] Variety later reported that the film barely crawled into the black but would post a modest profit for the studio.",
        "cast": "Vin Diesel as Dominic Toretto,  Jason Momoa as Dante Reyes,  Michelle Rodriguez as Letty Ortiz,  Jason Statham as Deckard Shaw,  Tyrese Gibson as Roman Pearce,  Ludacris as Tej Parker,  John Cena as Jakob Toretto,  Jordana Brewster as Mia Toretto,  Nathalie Emmanuel as Ramsey,  Sung Kang as Han Lue,  Brie Larson as Tess,  Alan Ritchson as Aimes,  Daniela Melchior as Isabel,  Scott Eastwood as Little Nobody,  Helen Mirren as Magdalene 'Queenie' Ellmans, Charlize Theron as Cipher, Rita Moreno as Abuelita Toretto",
        "active": false
      },



      {
        "_id": 2002,
        "titleImg": "https://drive.google.com/uc?id=1k9vx_zdW3NHIhyieVqswieipjXx7qcZn",
        "bgImg": "https://drive.google.com/uc?id=1CCsK4nTmlGGsdJ-5bgyYw2X-J2BCZpES",
        "previewImg": "https://drive.google.com/uc?id=1xxiPtD6asIqSsCYKgntrLtkTsMzZknoW",
        "video": "https://www.youtube.com/embed/dG91B3hHyY4",
        "title": "Meg 2",
        "fullTitle": "Meg 2: The Trench",
        "year": "2023",
        "date": "04th August",
        "ageLimit": "16+",
        "length": "1h 56min",
        "category": "Thriller",
        "type": "coming",
        "description": "Five years after the events of the first film, Jonas Taylor has been involved in fighting environmental crimes while also helping Mana One in exploring a further deep part of the Mariana Trench where the Megalodon had been found. Following the death of Suyin Zhang, Jonas has been raising her teenage daughter Meiying alongside her uncle and Suyin's brother Jiuming Zhang, who has acquired his father's company alongside wealthy financier Hillary Driscoll. Mana One has also been studying an 80 ft (24 m) female Meg called Haiqi, who was discovered as a pup and trained by Jiuming in a reserve in Hainan. Recently, Haiqi has been acting erratically, leading to Jonas being concerned despite Jiuming's enthusiasm. Jonas and Jiuming lead a routine submersible exploration to the Trench, with Meiying stowing away to see the trench for the first time. Fellow Meg survivors DJ and Mac observe the group from the Mana One. On their way down, the subs are pursued by Haiqi, who escaped captivity the previous night; the subs dive down through the thermocline to escape, but Haiqi forces her way through it anyway. Two much larger Megs, a massive alpha male and a slightly smaller beta male, appear and mate with Haiqi. While working on an escape plan, Jonas and his team discover an illegal mining operation in a station captained by the mercenary Montes, who has a vendetta against Jonas for his imprisonment some time before. Montes' crew was hired by the secretly corrupt Driscoll to covertly use the Mana One's access to the trench to farm rare earth minerals that could earn them billions. Montes kills his crew in an explosion to cover up their activities, which causes a rupture in the trench and grounds both Jonas’ and Jiuming's ships.         DJ, Mac, and fellow Mana One analyst Jess discover that the rescue pod has been sabotaged, forcing the crew to use exosuits to walk towards the station in the creature-filled trench, with only Jonas, Meiying, Jiuming and security officer Rigas surviving the journey. Jess reveals herself as a traitor and attempts to remotely kill the four, but they escape the station in another submersible after a scuffle with Montes, who escapes to the surface through a buoy. Driscoll sends mercenaries to take over the Mana One while Montes surfaces and meets with Jess. As the crew surfaces, they discover the rupture from earlier which leads to several of the creatures, including the three Megs, a swarm of lizard-like creatures known as Snappers and a giant octopus escaping the trench and reaching the surface.         Jonas’ crew meets with DJ and Mac, and Montes focuses the mercenaries on the crew after Jess is devoured by a Meg. Jonas’ team escapes to a nearby resort, Fun Island, to warn them of the approaching creatures. Driscoll, Montes and the mercenaries arrive at Fun Island to eliminate Jonas’ crew, but they are instead attacked by the Snappers, who devour Driscoll and several mercenaries. Jonas’ group splits up to evacuate the tourists as the Megs and the octopus begin their attack. Jonas manages to kill the beta male Meg using an explosive taped to a harpoon before being attacked by Montes, leading both to sail to the beach. The two battle before Jonas knocks Montes into the mouth of the alpha Meg to be consumed. Jiuming creates a bomb out of fertilizer and along with Mac takes over Driscoll's unattended helicopter to fly towards the beach where Meiying is trying to help tourists.         The octopus takes down the helicopter and Jiuming injures it with his bomb, attracting Haiqi, who engages in a battle with the Octopus and proceeds to kill the beast. As Jiuming swims towards the wreckage to save Mac, Jonas picks up one of the helicopter's rotors and uses it to fatally impale the alpha Meg through the head. Haiqi heads towards Jonas, Jiuming, and Mac, but Jiuming uses his training signals to divert her attention. Haiqi redirects her attention to a pod of dolphins swimming away. Making their way to the beach, Jiuming reasons that Haiqi escaped captivity because it was mating season, and discusses the possibility that she is pregnant. Jonas decides that it is better not to think about it, and the group celebrate their survival.",
        "budget": "As of October 5, 2023, Meg 2: The Trench has grossed $82.6 million in the United States and Canada, and $312.4 million in other territories, for a worldwide total of $395 million. In the United States and Canada, Meg 2: The Trench was projected to gross $20–30 million from 3503 theaters in its opening weekend.[2] It made $12 million on its first day, including $3.2 million from Thursday night previews. It went on to debut to $30 million, finishing second behind holdover Barbie. The film made $12.8 million and $6.7 million in its second and third weekends, finishing in fourth and sixth, respectively",
        "cast": "Jason Statham as Jonas Taylor, Meiying's stepfather and the husband of the late Suyin Zhang Wu Jing as Jiuming Zhang, Meiying's uncle,  Sophia Cai as Meiying, Jiuming's niece and Jonas' stepdaughter,  Cliff Curtis as Mac, Mana One operations manager,  Page Kennedy as DJ, an engineer at Mana One,  Sergio Peris Mencheta as Montes, a mercenary in charge of illegal mining operations,  Skyler Samuels as Jess, a Mana One worker,  Melissanthi Mahut as Rigas, a security officer at Mana One,  Whoopie Van Raam as Curtis, a diver at Mana One,  Kiran Sonia Sawar as Sal, a diver at Mana One,  Felix Mayr as Lance, a diver at Mana One,  Sienna Guillory as Driscoll, a billionaire investor who is financing Jiuming's efforts in the Mana One",
        "active": false
      },




      {
        "_id": 2001,
        "titleImg": "https://drive.google.com/uc?id=10zSdYvz8uuQs-R7y5vSJdsFxhezgDPbE",
        "bgImg": "https://drive.google.com/uc?id=1zMOr-jIxagj-HC1MJK2P_mh3f-8YYqzT",
        "previewImg": "https://drive.google.com/uc?id=1dnqM3nMkeXqwfOzK69KLCAAAevsuXMfc",
        "video": "https://www.youtube.com/embed/TxPNrwbuxN0",
        "title": "Transformer",
        "fullTitle": "Transformer: Rise of the Beast",
        "year": "2023",
        "date": "18th September",
        "ageLimit": "15+",
        "length": "2h 07min",
        "category": "Adventure",
        "type": "coming",
        "description": "The planet-eating Unicron attacks the homeworld of the Maximals, an advanced race of Transformers. The Terrorcons, Unicron’s heralds led by Scourge, want the Transwarp Key which can open portals through space and time and can help Unicron consume planets faster. The Maximal leader Apelinq sacrifices himself to allow the other Maximals to escape the planet before Unicron devours it. Now under the command of Optimus Primal, the Maximals flee to Earth with the key. In 1994 Brooklyn, Noah Diaz, an ex-military electronics expert, struggles to find a job to support his ill brother Kris and is convinced by his friend Reek to steal a Porsche to sell only to discover that it is the Autobot Mirage in disguise. Concurrently, museum intern Elena Wallace studies an ancient statue of a falcon bearing the Maximal symbol and accidentally breaks it open to reveal the key hidden inside. The key releases an energy pulse detected by Autobot leader Optimus Prime, who summons the other Autobots, including Arcee and Bumblebee. Mirage is contacted in the middle of Noah's attempted theft, and he is roped into the Autobots' mission to recover the key so they can use it to return to their homeworld, Cybertron.         Drawn by the key's signature, the Terrorcons arrive on Earth and attack the Autobots outside the museum, with Elena becoming caught up in the conflict. Scourge kills Bumblebee, steals the key, and retreats when the Maximal Airazor arrives. Airazor reveals that the Maximals have been hiding on Earth for millennia, and Scourge only has half of the Transwarp Key, which was split in two to keep it away from Unicron. Optimus insists that the key be reassembled so the Autobots can use it to return home, while Noah secretly plots to destroy the key to keep Earth safe.         Elena deduces that the other half of the key is in a hidden temple in Peru. The cargo plane Autobot, Stratosphere takes them to Peru, where they meet with Wheeljack, who leads them to the temple. However, the other half of the key is revealed to no longer be there. The Terrorcons attack again, and Scourge corrupts Airazor with Unicron's dark energy. Subsequently, the Autobots meet Optimus Primal and the other Maximals, who entrusted the second half of the key to a human tribe they have worked with for millennia. Scourge's corruption overtakes Airazor, whom Primal reluctantly kills at her request to save Elena. In the chaos, Noah attempts to destroy the second half of the key, but Optimus convinces him otherwise. Scourge steals it and then reassembles the two halves, erecting a tower and opening a portal above the Earth, which Unicron will soon go through.         Optimus and Noah agree to work together to protect their homeworlds from Unicron. While Autobots and Maximals battle the Terrorcon army, Noah and Elena sneak in close to the Key, planning to deactivate it with an access code Elena has uncovered. During the battle, Scourge wounds Mirage, who was protecting Noah, but transforms his damaged body into a powered exo-suit for Noah so they can fight together. Bumblebee is reactivated when the key activates the Energon-infused valley. He helps the Autobots and Maximals turn the tide of the battle. Optimus kills Scourge, but not before the latter damages the control console to prevent the portal from being shut down. Optimus destroys the key and collapses the portal, willing to sacrifice himself, but Noah and Primal save him from being sucked into the imploding vortex, which destroys the remaining Terrorcon army and leaves Unicron stranded.         In the aftermath, the Autobots, unable to return to Cybertron, proclaim Earth as their new home and vow to continue protecting it alongside the Maximals. Elena receives recognition for discovering the temple in Peru while Noah attends an interview for a security job but finds he is actually being invited to join the secret military organization G.I. Joe, who will cover Kris's healthcare.         In a mid-credits scene, Noah repairs Mirage using junk Porsche parts from Reek who claims it is unroad-worthy, and Noah disproves him by calling to Mirage to transform in front of Reek.",
        "budget": "In the United States and Canada, Rise of the Beasts was projected to gross $50–60 million from 3,673 theaters in its opening weekend.[87][4] The film made $25.6 million on its first day, including $8.8 million from Wednesday and Thursday night preview screenings, up from the totals of The Last Knight ($5.5 million in 2017) and Bumblebee ($2.85 million in 2018). It went on to debut to $60.5 million, topping the box office.[88] In its second weekend the film dropped 67% to $20 million, finishing fourth.[89] It then made $11.6 million in its third weekend.",
        "cast": "Anthony Ramos as Noah Diaz Dominique Fishback as Elena Wallace Luna Lauren Velez as Breanna Diaz Dean Scott Vazquez as Kris Diaz Tobe Nwigwe as Reek Sarah Stiles as Jillian Leni Parker as Ms. Greene Frank Marrs as Receptionist Aidan Devine as Bishop Kerwin Jackson as Hotel Security Guard Mike Chute as NYC Police Officer Tyler Hall as NYC Police Officer Sean Tucker as Bridge Security Guard Jay Farrar as Museum Guard Lucas Huarancca as Amaru Amiel Cayo as Amaru's Son Santusa Cupita as Amaru's Wife(as Santusa Cutipa) Yesenia Iquillay as Amaru's Granddaughter(as Yesenia) ",
        "active": false
      }


  ]
